app/views/hotels_pics/_form.html.erb

SELECT `hotels`.* FROM `hotels`
---
    <!--<%= f.text_field :hotel %>-->
    <%= f.collection_select :hotel_id, Hotel.all, :id, :name %>