app/controllers/hotels_pics_controller.rb

SELECT `hotels_pics`.* FROM `hotels_pics`
---
  def index
    @hotels_pics = HotelsPic.all

SELECT `hotels_pics`.* FROM `hotels_pics` WHERE `hotels_pics`.`id` = 1 LIMIT 1
---
  def show
    @hotels_pic = HotelsPic.find(params[:id])

SELECT `hotels_pics`.* FROM `hotels_pics` WHERE `hotels_pics`.`id` = 1 LIMIT 1
---
  def edit
    @hotels_pic = HotelsPic.find(params[:id])

INSERT INTO `hotels_pics` (`created_at`, `description`, `hotel_id`, `image`, `title`, `updated_at`) VALUES ('2014-05-19 17:24:54', 'Ay kalam', 1, '/home/kimo', 'Amoon', '2014-05-19 17:24:54')
---
  def create
    @hotels_pic = HotelsPic.new(params[:hotels_pic])

    uploaded_io = params[:hotels_pic][:image]

    File.open(Rails.root.join('app', 'assets', 'images', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
    end

    @hotels_pic.image = uploaded_io.original_filename

    respond_to do |format|
      if @hotels_pic.save

SELECT `hotels_pics`.* FROM `hotels_pics` WHERE `hotels_pics`.`id` = 1 LIMIT 1
UPDATE `hotels_pics` SET `image` = 'AppleiPhoneLTE.jpg', `updated_at` = '2014-05-19 20:38:39' WHERE `hotels_pics`.`id` = 3
---
  def update
    @hotels_pic = HotelsPic.find(params[:id])

    #delete old picture
    File.delete(Rails.root + 'app/assets/images/' + @hotels_pic.image)

    # new uploaded image
    uploaded_io = params[:hotels_pic][:image]

    File.open(Rails.root.join('app', 'assets', 'images', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
    end

    # change image field to image name only not image file
    params[:hotels_pic][:image] = uploaded_io.original_filename

    respond_to do |format|
      if @hotels_pic.update_attributes(params[:hotels_pic])

SELECT `hotels_pics`.* FROM `hotels_pics` WHERE (hotel_id = '1')
SELECT `rates`.* FROM `rates` WHERE (hotel_id = '7')
---
  def hotel_pics
  	@hotel_pics = HotelsPic.where("hotel_id = ?", params[:hotel_id])

  	@hotel_rates = Rate.all#where("hotel_id = ?", params[:hotel_id])