app/controllers/hotels_controller.rb

  def index
    @hotels = Hotel.all
---
SELECT `hotels`.* FROM `hotels`

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT `hotels`.* FROM `hotels` WHERE `hotels`.`id` = 1 LIMIT 1

  def create
    @hotel = Hotel.new(params[:hotel])

    respond_to do |format|
      if @hotel.save
---
INSERT INTO `hotels` (`city`, `country`, `created_at`, `name`, `updated_at`) VALUES ('Alex', 'Egypt', '2014-05-19 15:59:17', 'Amoon', '2014-05-19 15:59:17')