app/controllers/rates_controller.rb

SELECT `rates`.* FROM `rates`
---
  def index
    @rates = Rate.all

SELECT `rates`.* FROM `rates` WHERE `rates`.`id` = 1 LIMIT 1
---
  def show
    @rate = Rate.find(params[:id])

INSERT INTO `rates` (`body`, `created_at`, `hotel_id`, `rate`, `tilte`, `updated_at`, `user_id`) VALUES ('ay 7aga', '2014-05-20 11:15:23', 1, 1, 'ay kalam', '2014-05-20 11:15:23', 1)
---
  def create
    @rate = Rate.new(params[:rate])

    respond_to do |format|
      if @rate.save

INSERT INTO `rates` (`body`, `created_at`, `hotel_id`, `rate`, `tilte`, `updated_at`, `user_id`) VALUES ('', '2014-05-20 13:22:30', 1, NULL, '', '2014-05-20 13:22:30', 1)
---
  def addrate
    @rate_data = {"user_id" => params[:user_id], "hotel_id" => params[:hotel_id], "tilte" => params[:title], "body" => params[:body], "rate" => params[:rate]}

    @rate = Rate.new(@rate_data)
    @rate.save