app/controllers/res_rooms_controller.rb

SELECT `res_rooms`.* FROM `res_rooms` WHERE `res_rooms`.`id` = 6 LIMIT 1
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
---
  def show
    @res_room = ResRoom.find(params[:id])

INSERT INTO `res_rooms` (`chkin_date`, `chkout_date`, `created_at`, `hotel_id`, `room_id`, `updated_at`, `user_id`) VALUES ('2014-12-20', '2014-12-20', '2014-05-20 13:01:52', 1, 1, '2014-05-20 13:01:52', 2)
---
  def register
  	 hotel_id = params[:hotel_id]
  		user_id = session[:user_id]
  		room_id = params[:room_id]
  		data={"user_id"=>user_id,
 "room_id"=>room_id,
 "hotel_id"=>hotel_id,
 "chkin_date"=>$h_from,
 "chkout_date"=>$h_to}
  		@res_room = ResRoom.new(data)

    respond_to do |format|
      if @res_room.save