app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `name`, `salt`, `updated_at`) VALUES ('2014-05-19 17:09:36', 'ashraf@yahoo.com', '$2a$10$iBi8vGxrUs2RTS6cA0t7Au.mH.TtcIaLDP9Wm27OF7wCSDXqGdtUG', 'ashraf', NULL, '2014-05-19 17:09:36')