app/views/rates/_form.html.erb

SELECT `users`.* FROM `users`
---
    <!--<%= f.text_field :user %>-->
    <%= f.collection_select :user_id, User.all, :id, :name %>

SELECT `hotels`.* FROM `hotels`
---
    <!--<%= f.text_field :hotel %>-->
    <%= f.collection_select :hotel_id, Hotel.all, :id, :name %>